const legalPosition = `
<p style="margin-bottom: 25px">Підпорядкування підприємств, установ (закладів), організацій визначається нормативно-правовими актами відповідно до яких розпорядники здійснюють свої повноваження. Це, зокрема, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про центральні органи виконавчої влади”</a> (частина 12 статті 8 й частина 18 статті 19), <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про місцеве самоврядування в Україні”</a> (стаття 17, 26, 32, 42), <a href="https://zakon.rada.gov.ua/laws/show/436-15">Господарський кодекс України</a> (стаття 75 — 77, 126) та інші. Віднесення підприємств, установ (закладів), організацій до сфери управління ЦОВВ може визначатись окремим розпорядчими документами, наприклад, <a href="https://zakon.rada.gov.ua/laws/show/902-2013-%D1%80">Розпорядження КМУ від 23.10.2013 р. № 902-р</a>, <a href="https://zakon.rada.gov.ua/laws/show/265-2011-%D1%80">Розпорядження КМУ від 21.03.2011 р. № 265-р</a>, <a href="https://zakon.rada.gov.ua/rada/show/v0152282-18">Наказ МОЗ 26.01.2018 № 152</a> тощо.</p>
<p style="margin-bottom: 25px">Ідентифікаційні та контактні дані юридичних осіб фіксуються під час затвердження установчих документів і державної реєстрації. <a href="https://zakon.rada.gov.ua/laws/show/755-15">Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань”</a> визначає переліки відомостей, які зберігають в Єдиному державному реєстрі юридичних осіб, фізичних осіб-підприємців та громадських формувань (далі — ЄДР) для юридичних осіб (частина 2 статті 9) та державних органів і органів місцевого самоврядування, як юридичних осіб (частина 3 статті 9). Серед інформації, переліченої у назві набру в ЄДР, не фіксується лише назва офіційного веб-сайту.</p>
<p style="margin-bottom: 25px">Потрібно також враховувати, що дані набору є за змістом ширшими аніж дані ЄДР. У законодавстві відсутнє єдине визначення термінів “установа”, “заклад”, “організація”. Вони можуть співпадати та не співпадати з юридичною особою. Наприклад, закладом освіти є “юридична особа публічного чи приватного права [...]” (частина 1 статті 1 <a href="https://zakon.rada.gov.ua/laws/show/2145-19">Закону України “Про освіту”</a>), закладом охорони здоров’я — “юридична особа будь-якої форми власності та організаційно-правової форми або її відокремлений підрозділ [...]” (стаття 3, <a href="https://zakon.rada.gov.ua/laws/show/2801-12/ed20190101">Закону України “Основи законодавства України про охорону здоров'я”</a>). Тому набір необхідно формувати на основі ЄДР, враховуючи специфіку профільного законодавства.</p>
<p style="margin-bottom: 25px">Відповідно до <a href="https://zakon.rada.gov.ua/laws/show/2939-17">Закону України “Про доступ до публічної інформації”</a>, розпорядники зобов’язані оприлюднювати інформацію про місцезнаходження, поштову адресу, номери засобів зв'язку, адреси офіційного веб-сайту та електронної пошти (частина 1 статті 15). <a href="https://zakon.rada.gov.ua/rada/show/v0055609-03">ДСТУ 4163-2003</a> та <a href="https://zakon.rada.gov.ua/laws/show/55-2018-%D0%BF">Постанова КМУ № 55 від 17.01.2018 р.</a> визначають, які ідентифікаційні та контактні дані мають зазначатись у реквізитах документів.</p>
<p style="margin-bottom: 25px">Окрім переліченого, в Україні функціонує <a href="http://email.court.gov.ua/">Єдина база даних електронних адрес, номерів факсів (телефаксів) суб'єктів владних повноважень</a>, що створена відповідно до статті 38 <a href="https://zakon.rada.gov.ua/laws/show/2747-15">Кодексу адміністративного судочинства</a> та <a href="https://zakon.rada.gov.ua/laws/show/5-2011-%D0%BF/ed20110118/">Постанови КМУ від 05.01.2011 р. № 5</a>. Мета створення бази — збір контактних даних для надсилання суб'єктам владних повноважень тексту повісток.</p>
`

const structure = [
  {
    "name": "identifier",
    "titles": "Ідентифікатор",
    "dc:description": "Ідентифікатором посадової особи/працівника може бути номер особової справи, ідентифікатор з систем документообігу або будь-яка інша довільна комбінація літер та чисел. Наприклад: ДІ-001. Ідентифікатором не можуть бути персональні дані: дата народження, реєстраційний номер облікової картки платника податків.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "name",
    "titles": "Ім’я",
    "dc:description": "Прізвище, ім’я, по батькові посадової особи/працівника. Наприклад: Ковальчук Андрій Іванович.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "gender",
    "titles": "Стать",
    "dc:description": "Стать зазначається цифрами відповідно до стандарту ISO/IEC 5218:2004: 0 — невідомо, 1 — чоловік, 2 — жінка, 9 — не застосовується. Наприклад: 2.",
    "datatype": "integer",
    "required": true
  },
  {
    "name": "postPrefLabel",
    "titles": "Посада",
    "dc:description": "Повна назва посади відповідно до штатного розпису або іншого офіційного документа. Наприклад: Начальник Управління економічного розвитку.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "orgUnitIdentifier",
    "titles": "Належність до структурного підрозділу (ідентифікатор)",
    "dc:description": "Ідентифікатор структурного підрозділу, до якого належить посада, з таблиці OrganizationalUnits колонка identifier. Наприклад: 01234567-01. Якщо структурний підрозділ відсутній вказати null.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "orgUnitPrefLabel",
    "titles": "Належність до структурного підрозділу (назва)",
    "dc:description": "Назва структурного підрозділу, до якого належить посада. Наприклад: Відділ соціального забезпечення. Якщо структурний підрозділ відсутній, вказати null.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "orgIdentifier",
    "titles": "Належність до юридичної особи (ідентифікатор)",
    "dc:description": "Код ЄДРПОУ юридичної особи, до якої належить посада. Наприклад: 01234567.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "orgPrefLabel",
    "titles": "Належність до юридичної особи (назва)",
    "dc:description": "Повна назва юридичної особи, до якої належить посада. Наприклад: Управління охорони здоров’я Ужгородської міської ради.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "img",
    "titles": "Фото",
    "dc:description": "Посилання на знімок обличчя, що оприлюднений у мережі Інтернет (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/photo.png. Якщо фото відсутнє, вказати null.",
    "datatype": "anyURI",
    "required": false
  },
  {
    "name": "homepage",
    "titles": "Веб-сторінка",
    "dc:description": "Посилання на веб-сторінку посадової особи/працівника на сайті розпорядника (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/head/. Якщо сторінки не ведуться, вказати null.",
    "datatype": "anyURI",
    "required": false
  },
  {
    "name": "account",
    "titles": "Посилання на сторінки в соціальних медіа",
    "dc:description": "Якщо посадова особа використовує соціальні медіа (Facebook, Twitter, Instagram, YouTube та ін.) для комунікації з громадськістю, вказати посилання на офіційні облікові записи. Розміщувати посилання можна лише за згодою особи й лише коли їх використання має зв’язок із здійсненням повноважень. Посилання мають бути відділені комами й починатися з http:// або https://. Наприклад: https://www.example-1.com/, https://www.example-2.com/.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "phone",
    "titles": "Номер телефону",
    "dc:description": "Номер телефону має починатися з +380, включати код населеного пункту або оператора та телефонний номер (12 цифр, без пробілів і дужок). Наприклад: +380123456789. У електронних таблицях допускається написання коду країни 380 або використання комбінації ‘+ (апостроф та плюс). У випадку кількох номерів телефону розділити значення комою.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "mbox",
    "titles": "Адреса електронної адреси",
    "dc:description": "Адреса електронної адреси особи, що посідає посаду або виконує обов’язки. Наприклад, example@example.gov.ua.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "openingHours",
    "titles": "Дні та години прийому",
    "dc:description": "Дні тижня позначаються комбінаціями літер: Пн, Вт, Ср, Чт, Пт, Сб, Нд, години — цифрами у 24-годинному форматі — ГГ:ХХ. Для графіка з понеділка до п’ятниці, з 9:00 до 17:00 запис в таблиці матиме вигляд — Пн-Пт 09:00-17:00. Коли потрібно позначити інтервал днів (з понеділка до п’ятниці), використовується дефіс, коли окремі дні (понеділок та п’ятниця) — кома. Наприклад, графік прийому в понеділок і п’ятницю з 09:00-17:00 матиме такий вигляд: Пн,Пт 09:00-17:00. Якщо графік змінюється протягом тижня, різні режими прийому необхідно записати через кому. Наприклад: Пн-Чт 08:00-17:20, Пт 08:00-16:00.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "availabilityRestriction",
    "titles": "Обмеження прийому",
    "dc:description": "Уточнення щодо обідньої перерви, днів, коли графік діє та ін. Наприклад: Перерва на обід — 12:00-13:00; Прийом відбувається лише кожного першого понеділка місяця.",
    "datatype": "string",
    "required": false
  }
]

const info = {
  id: 'posts',
  parent: 'reference-book',
  description: 'Довідник посадових осіб/працівників юридичної особи розпорядника',
  legislation: '<a href="https://zakon.rada.gov.ua/laws/show/755-15">Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань”</a>, <a href="https://zakon.rada.gov.ua/laws/show/2939-17">Закон України “Про доступ до публічної інформації”</a>, нормативно-правові акти, що визначають повноваження розпорядників, наприклад, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про центральні органи виконавчої влади”</a>, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про місцеве самоврядування в Україні”</a>, установчі документи та інше',
  dataManagers: 'Всі розпорядники публічної інформації відповідно до частини 1 статті 13 Закону України “Про доступ до публічної інформації”',
  content: 'Ідентифікаційні та контактні дані юридичних осіб фіксуються під час затвердження установчих документів і державної реєстрації. Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань” визначає перелік відомостей, які зберігаються у ЄДР (стаття 9).',
  updatedOn: 'Створення нових підприємств, установ (закладів) та організацій. Зміна їх контактних або реєстраційних даних. Зміни внутрішньоорганізаційної структури, кадрові зміни.',
  frequency: 'Позапланово (протягом трьох робочих днів з моменту внесення змін)',
  type: 'Структуровані дані',
  formats: ['XLSX', 'ODS', 'CSV', 'Other structured'],
  legalPosition,
  structure
}