const Joi = require('joi')

const schema = Joi.object({
  identifier: Joi.string()
    .required()
    .description('Ідентифікатором посадової особи/працівника може бути номер особової справи, ідентифікатор з систем документообігу або будь-яка інша довільна комбінація літер та чисел. Наприклад: ДІ-001. Ідентифікатором не можуть бути персональні дані: дата народження, реєстраційний номер облікової картки платника податків.'),
  
  name: Joi.string()
    .required()
    .description('Прізвище, ім’я, по батькові посадової особи/працівника. Наприклад: Ковальчук Андрій Іванович.'),

  gender: Joi.number()
    .integer()
    .valid(0, 1, 2, 9)
    .required()
    .description('Стать зазначається цифрами відповідно до стандарту ISO/IEC 5218:2004: 0 — невідомо, 1 — чоловік, 2 — жінка, 9 — не застосовується. Наприклад: 2.'),

  postPrefLabel: Joi.string()
    .required()
    .description('Повна назва посади відповідно до штатного розпису або іншого офіційного документа. Наприклад: Начальник Управління економічного розвитку.'),

  orgUnitIdentifier: Joi.string()
    .allow(null)
    .required()
    .description('Ідентифікатор структурного підрозділу, до якого належить посада, з таблиці OrganizationalUnits колонка identifier. Наприклад: 01234567-01. Якщо структурний підрозділ відсутній вказати null.'),

  orgUnitPrefLabel: Joi.string()
    .allow(null)
    .required()
    .description('Назва структурного підрозділу, до якого належить посада. Наприклад: Відділ соціального забезпечення. Якщо структурний підрозділ відсутній, вказати null.'),

  orgIdentifier: Joi.string()
    .required()
    .description('Код ЄДРПОУ юридичної особи, до якої належить посада. Наприклад: 01234567.'),

  orgPrefLabel: Joi.string()
    .required()
    .description('Повна назва юридичної особи, до якої належить посада. Наприклад: Управління охорони здоров’я Ужгородської міської ради.'),

  img: Joi.string()
    .uri()
    .allow(null)
    .description('Посилання на знімок обличчя, що оприлюднений у мережі Інтернет (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/photo.png. Якщо фото відсутнє, вказати null.'),

  homepage: Joi.string()
    .uri()
    .allow(null)
    .description('Посилання на веб-сторінку посадової особи/працівника на сайті розпорядника (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/head/. Якщо сторінки не ведуться, вказати null.'),

  account: Joi.string()
    .allow(null)
    .description('Якщо посадова особа використовує соціальні медіа (Facebook, Twitter, Instagram, YouTube та ін.) для комунікації з громадськістю, вказати посилання на офіційні облікові записи. Розміщувати посилання можна лише за згодою особи й лише коли їх використання має зв’язок із здійсненням повноважень. Посилання мають бути відділені комами й починатися з http:// або https://. Наприклад: https://www.example-1.com/, https://www.example-2.com/.'),

  phone: Joi.string()
    .allow(null)
    .pattern(/^\+380\d{9}$/)
    .description('Номер телефону має починатися з +380, включати код населеного пункту або оператора та телефонний номер (12 цифр, без пробілів і дужок). Наприклад: +380123456789. У електронних таблицях допускається написання коду країни 380 або використання комбінації ‘+ (апостроф та плюс). У випадку кількох номерів телефону розділити значення комою.'),

  mbox: Joi.string()
    .email()
    .allow(null)
    .description('Адреса електронної адреси особи, що посідає посаду або виконує обов’язки. Наприклад, example@example.gov.ua.'),

  openingHours: Joi.string()
    .allow(null)
    .description('Дні тижня позначаються комбінаціями літер: Пн, Вт, Ср, Чт, Пт, Сб, Нд, години — цифрами у 24-годинному форматі — ГГ:ХХ. Для графіка з понеділка до п’ятниці, з 9:00 до 17:00 запис в таблиці матиме вигляд — Пн-Пт 09:00-17:00. Коли потрібно позначити інтервал днів (з понеділка до п’ятниці), використовується дефіс, коли окремі дні (понеділок та п’ятниця) — кома. Наприклад, графік прийому в понеділок і п’ятницю з 09:00-17:00 матиме такий вигляд: Пн,Пт 09:00-17:00. Якщо графік змінюється протягом тижня, різні режими прийому необхідно записати через кому. Наприклад: Пн-Чт 08:00-17:20, Пт 08:00-16:00.'),

  availabilityRestriction: Joi.string()
    .allow(null)
    .description('Уточнення щодо обідньої перерви, днів, коли графік діє та ін. Наприклад: Перерва на обід — 12:00-13:00; Прийом відбувається лише кожного першого понеділка місяця.')
})

module.exports = schema
