<template>
  <div class="menu" style="position: absolute;">
    <v-img class="mr-8 flex-grow-0" src="/logo.svg" height="48" width="48" contain />
    <a href="">Набори даних</a>
    <a href="">Допомога</a>
    <a href="">Налаштування</a>
  </div>
  <div class="hero-unit bg-light-grey d-flex justify-center align-center d-flex flex-column">
    <v-img class="flex-grow-0 mb-4" src="/logo-transparent.svg" height="148" width="148" contain />
    <div class="text-h3 mb-4">TrueData</div>
    <div class="mb-6">Ваш надійний помічник у сфері публікації відкритих даних</div>
    <div>
      <v-text-field
        class="flex-grow-0 rounded-circle main-search"
        style="width: 580px; border-radius: 50px !important; overflow: hidden;"
        placeholder="Оберіть набір даних"
        variant="solo"
        density="comfortable"
        hide-details
        append-inner-icon="mdi-magnify"
      />
      <div class="mt-2 ml-4" style="font-size: 12px; font-weight: 200;">Наприклад: <u>Реєстр комунальних підприємств</u></div>
    </div>
  </div>
  <div>
    <v-container fluid class="pl-16 pr-16 mb-16">
      <v-row class="mt-10 mb-10">
        <v-col cols="4">
          <d-alert density="normal">
            <h2 class="text-h2">32</h2>
            <div>Опубікованих набори</div>
          </d-alert>
        </v-col>
        <v-col cols="4">
          <d-alert density="normal">
            <h2 class="text-h2">28</h2>
            <div>Набори відповідають стандарту</div>
          </d-alert>
        </v-col>
        <v-col cols="4">
          <d-alert density="normal">
            <h2 class="text-h2">12,021</h2>
            <div>Завантажень</div>
          </d-alert>
        </v-col>
      </v-row>
      <v-row>
        <v-col cols="12">
          <h1>Пошук наборів</h1>
          <v-text-field
            v-model="search"
            class="d-text big-text-field"
            variant="underlined"
            hide-details
            />
          </v-col>
      </v-row>
      <v-row class="mt-8">
        <v-col cols="12">
          <d-block-link href="dataset" v-for="(d, i) in filteredList">{{ d }}</d-block-link>
        </v-col>
      </v-row>

    </v-container>
  </div>
  <global-footer />
</template>

<style>
</style>

<script>
export default {
  computed: {
    filteredList () {
      if (!this.search) return this.datasetList
      const regex = new RegExp(this.search, 'gi')
      return this.datasetList.filter(el => el.match(regex))
    }
  },
  data () {
    return {
      search: undefined,
      datasetList: [
        'Звіти про виконання фінансових планів комунальних підприємств',
        'Титульні списки на проведення капітального та поточного ремонту, будівництва, реконструкції та благоустрою',
        'Інформація про рекламні засоби (дані про місце розміщення рекламного засобу, його вид і розміри, найменування розповсюджувача зовнішньої реклами, номер телефону розміщувача реклами, адреса електронної пошти, дата видачі дозволу та строк його дії, номер і дата укладення договору, якщо місце розміщення рекламного засобу належить до комунальної власності)',
        'Перелік інвестиційних договорів, додатків, додаткових угод та інших матеріалів до них, умов, у тому числі посилань на оприлюднені ресурси в Інтернеті',
        'Дані про об’єкти та засоби торгівлі (пересувної, сезонної тощо)',
        'Відомості про ярмарки (строк проведення, місце, кількість та вартість місць), організаторів ярмарків, договори, укладені з організаторами таких ярмарків',
        'Відомості про залучення, розрахунок розміру і використання коштів пайової участі у розвитку інфраструктури населеного пункту',
        'Відомості про транспортні засоби, які обслуговують пасажирські автобусні, тролейбусні та трамвайні маршрути перевезення (кількість транспортних засобів на кожному маршруті, марка, модель, державний номер, пасажиромісткість)',
        'Дані про місце розміщення зупинок міського електричного та автомобільного транспорту',
        'Відомості про лікарські засоби/препарати, придбані за бюджетні кошти, відомості про розподілення таких ліків між закладами охорони здоров’я та їх залишки в кожному з них',
        'Поіменні результати голосування депутатів на пленарних засіданнях органу місцевого самоврядування',
        'Дані про депутатів місцевих рад, у тому числі контактну інформацію та графік прийому',
        'Дані про зелені насадження, що підлягають видаленню, відповідно до виданих актів обстеження зелених насаджень',
        'Дані про доступність будівель для осіб з інвалідністю та інших маломобільних груп населення',
        'Дані про надходження звернень на телефонні “гарячі лінії”, в аварійно-диспетчерські служби, телефонні центри тощо',
        'Дані про електронні петиції, у тому числі осіб, що їх підписали, та результати розгляду',
        'Дані громадського бюджету, бюджету участі тощо, у тому числі про проекти, результати голосування, реалізацію підтриманих проектів',
        'Дані про паркування, у тому числі розміщення майданчиків, їх операторів, обладнання та функціонування',
        'Адресний реєстр',
        'Дані про надані адміністративні послуги',
        'Дані про видані будівельні паспорти',
        'Дані про медичне обладнання комунальних закладів охорони здоров’я',
        'Дані про розміщення спецтехніки, що використовується для надання комунальних послуг, благоустрою, виконання будівельних та ремонтних робіт',
        'Дані про черги дітей у дошкільні навчальні заклади',
        'Території обслуговування загальноосвітніх навчальних закладів',
        'Дані містобудівного кадастру, у тому числі геопросторові дані',
        'Дані про видані дозволи на порушення об’єктів благоустрою',
        'Дані про облік громадян, які потребують поліпшення житлових умов (квартирний облік)',
        'Дані про споживання комунальних послуг (електрична енергія, теплова енергія, природний газ, тверде паливо, рідке паливо холодна та гаряча вода із зазначенням частки відновлюваних джерел енергії) комунальними підприємствами, установами та організаціями',
        'Надходження і використання благодійної допомоги',
        'Планові та фактичні показники сплати за договорами оренди комунальної власності, розміщення тимчасових споруд, розміщення рекламних засобів',
        'Перелік об’єктів комунальної власності, що передані в оренду чи інше право користування (з даними про умови передачі об’єктів в оренду чи умови іншого користування) до закінчення строку, встановленого пунктом 6 розділу “Прикінцеві та перехідні положення” Закону України “Про оренду державного та комунального майна”',
        'Перелік об’єктів комунальної власності, які можуть бути передані в оренду (до дати, визначеної підпунктом 1 пункту 1 розділу “Прикінцеві та перехідні положення” Закону України “Про оренду державного та комунального майна”)',
        'Схеми планування території областей, схеми планування території районів, генеральні плани населених пунктів, плани зонування території, детальні плани території, містобудівна документація територіальних громад, їх проекти (відповідно до повноважень)',
        'Дані про місцезнаходження міського електричного та пасажирського автомобільного транспорту в режимі реального часу, у тому числі короткострокові зміни в русі транспорту та час прибуття транспорту на зупинки в режимі реального часу',
        'Дані про розміщення громадських вбиралень комунальної власності',
        'Перелік перевізників, що надають транспортні послуги з перевезення пасажирів міським електричним та автомобільним транспортом, у тому числі маршрути перевезень',
        'Розклад руху міського електричного та автомобільного транспорту',
        'Перелік земельних ділянок комунальної власності, що пропонуються для передачі у власність громадян та юридичних осіб або для надання у користування',
        'Перелік орендарів, з якими укладено договори оренди землі комунальної власності',
        'Дані щодо ремонту автомобільних доріг місцевого значення',
        'Реєстр містобудівних умов та обмежень',
        'Дані про тарифи на комунальні послуги, які затверджуються органом місцевого самоврядування',
        'Перелік цільових місцевих програм, змін до цільових місцевих програм та звітів про виконання цільових місцевих програм',
        'Перелік заяв щодо безоплатної приватизації земельних ділянок громадянами',
        'Дані про розміщення тимчасових споруд для провадження підприємницької діяльності',
        'Дані про місцезнаходження комунальних контейнерів (за категоріями), контейнерних майданчиків, місць прийому небезпечних відходів, вторинної сировини',
        'Дані про місцезнаходження комунальних об’єктів управління відходами, їх площі та обсяги надходжень',
        'Дані про вилов, стерилізацію та ідентифікацію безпритульних тварин',
        'Дані про дитячі, спортивні та інші майданчики для дозвілля та відпочинку, що перебувають у комунальній власності',
        'Дані про накладені штрафи за порушення правил паркування транспортних засобів',
        'Дані про місцезнаходження зон для вигулу домашніх тварин',
        'Дані щодо місцезнаходження камер відеоспостереження, що перебувають у комунальній власності',
        'Дані про розташування захисних споруд цивільного захисту комунальної власності',
        'Дані про місцезнаходження зарядних станцій для електричного транспорту',
        'Дані про експлуатаційні характеристики будівель комунальних підприємств, установ (закладів) та організацій, в яких впроваджено системи енергетичного менеджменту.'
      ]
    }
  }
}
</script>
