const legalPosition = `
<p style="margin-bottom: 25px">Підпорядкування підприємств, установ (закладів), організацій визначається нормативно-правовими актами відповідно до яких розпорядники здійснюють свої повноваження. Це, зокрема, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про центральні органи виконавчої влади”</a> (частина 12 статті 8 й частина 18 статті 19), <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про місцеве самоврядування в Україні”</a> (стаття 17, 26, 32, 42), <a href="https://zakon.rada.gov.ua/laws/show/436-15">Господарський кодекс України</a> (стаття 75 — 77, 126) та інші. Віднесення підприємств, установ (закладів), організацій до сфери управління ЦОВВ може визначатись окремим розпорядчими документами, наприклад, <a href="https://zakon.rada.gov.ua/laws/show/902-2013-%D1%80">Розпорядження КМУ від 23.10.2013 р. № 902-р</a>, <a href="https://zakon.rada.gov.ua/laws/show/265-2011-%D1%80">Розпорядження КМУ від 21.03.2011 р. № 265-р</a>, <a href="https://zakon.rada.gov.ua/rada/show/v0152282-18">Наказ МОЗ 26.01.2018 № 152</a> тощо.</p>
<p style="margin-bottom: 25px">Ідентифікаційні та контактні дані юридичних осіб фіксуються під час затвердження установчих документів і державної реєстрації. <a href="https://zakon.rada.gov.ua/laws/show/755-15">Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань”</a> визначає переліки відомостей, які зберігають в Єдиному державному реєстрі юридичних осіб, фізичних осіб-підприємців та громадських формувань (далі — ЄДР) для юридичних осіб (частина 2 статті 9) та державних органів і органів місцевого самоврядування, як юридичних осіб (частина 3 статті 9). Серед інформації, переліченої у назві набру в ЄДР, не фіксується лише назва офіційного веб-сайту.</p>
<p style="margin-bottom: 25px">Потрібно також враховувати, що дані набору є за змістом ширшими аніж дані ЄДР. У законодавстві відсутнє єдине визначення термінів “установа”, “заклад”, “організація”. Вони можуть співпадати та не співпадати з юридичною особою. Наприклад, закладом освіти є “юридична особа публічного чи приватного права [...]” (частина 1 статті 1 <a href="https://zakon.rada.gov.ua/laws/show/2145-19">Закону України “Про освіту”</a>), закладом охорони здоров’я — “юридична особа будь-якої форми власності та організаційно-правової форми або її відокремлений підрозділ [...]” (стаття 3, <a href="https://zakon.rada.gov.ua/laws/show/2801-12/ed20190101">Закону України “Основи законодавства України про охорону здоров'я”</a>). Тому набір необхідно формувати на основі ЄДР, враховуючи специфіку профільного законодавства.</p>
<p style="margin-bottom: 25px">Відповідно до <a href="https://zakon.rada.gov.ua/laws/show/2939-17">Закону України “Про доступ до публічної інформації”</a>, розпорядники зобов’язані оприлюднювати інформацію про місцезнаходження, поштову адресу, номери засобів зв'язку, адреси офіційного веб-сайту та електронної пошти (частина 1 статті 15). <a href="https://zakon.rada.gov.ua/rada/show/v0055609-03">ДСТУ 4163-2003</a> та <a href="https://zakon.rada.gov.ua/laws/show/55-2018-%D0%BF">Постанова КМУ № 55 від 17.01.2018 р.</a> визначають, які ідентифікаційні та контактні дані мають зазначатись у реквізитах документів.</p>
<p style="margin-bottom: 25px">Окрім переліченого, в Україні функціонує <a href="http://email.court.gov.ua/">Єдина база даних електронних адрес, номерів факсів (телефаксів) суб'єктів владних повноважень</a>, що створена відповідно до статті 38 <a href="https://zakon.rada.gov.ua/laws/show/2747-15">Кодексу адміністративного судочинства</a> та <a href="https://zakon.rada.gov.ua/laws/show/5-2011-%D0%BF/ed20110118/">Постанови КМУ від 05.01.2011 р. № 5</a>. Мета створення бази — збір контактних даних для надсилання суб'єктам владних повноважень тексту повісток.</p>
`


const structure = [
  {
    "name": "identifier",
    "titles": "Ідентифікатор",
    "dc:description": "Номер або будь-який інший унікальний ідентифікатор структурного підрозділу. Наприклад: 1.2.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "prefLabel",
    "titles": "Повна назва",
    "dc:description": "Назва відповідно до організаційно-розпорядчих документів. Наприклад: Архівний відділ.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "altLabel",
    "titles": "Коротка або альтернативна назва",
    "dc:description": "Будь-яка інша, у тому числі скорочена назва. Наприклад: Архів.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "description",
    "titles": "Опис",
    "dc:description": "Короткий опис у довільній формі (декілька речень або до 300 символів). Опис має включати коротку інформацію про мету, функції, діяльність. Рекомендовано, щоб опис не дублював дані в інших колонках таблиці.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "constituentDocumentURL",
    "titles": "Установчий документ",
    "dc:description": "Посилання на оприлюднений в мережі Інтернет установчий або інший офіційний документ, що визначає мету діяльності, повноваження, функції (наприклад, статут, положення). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/polozhennia. Якщо документ не оприлюднений вказати null.",
    "datatype": "anyURI",
    "required": false
  },
  {
    "name": "homepage",
    "titles": "Веб-сторінка",
    "dc:description": "Посилання на веб-сторінку в мережі Інтернет (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/strat-plan/.",
    "datatype": "anyURI",
    "required": false
  },
  {
    "name": "headFn",
    "titles": "Ім’я керівника",
    "dc:description": "Повне прізвище, ім’я, по батькові керівника. Наприклад: Коваль Олена Вікторівна.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "headPost",
    "titles": "Посада керівника",
    "dc:description": "Повна назва посади керівника. Наприклад: Начальник департаменту.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "unitOfIdentifier",
    "titles": "Належність (ідентифікатор юридичної особи)",
    "dc:description": "Код ЄДРПОУ юридичної особи, в структуру якої входить даний підрозділ. Наприклад, 01234567.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "unitOfPrefLabel",
    "titles": "Належність (назва юридичної особи)",
    "dc:description": "Повна назва юридичної особи, в структуру якої входить даний підрозділ. Наприклад: Міністерство економічного розвитку і торгівлі України.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "subUnitOfIdentifier",
    "titles": "Підпорядкування (ідентифікатор підрозділу)",
    "dc:description": "Ідентифікатор структурного підрозділу з колонки identifier, якому підпорядковується або частиною якого є даний структурний підрозділ. Наприклад: 1.1. Якщо департамент складається з відділів, то кожен відділ підпорядковується департаменту. Якщо підпорядкування відсутнє, вказати null.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "subUnitOfPrefLabel",
    "titles": "Підпорядкування (назва підрозділу)",
    "dc:description": "Назва структурного підрозділу з колонки prefLabel, якому підпорядковується або частиною якого є даний структурний підрозділ. Наприклад: Департамент регуляторної політики. Якщо департамент складається з відділів, то кожен відділ підпорядковується департаменту. Якщо підпорядкування відсутнє, вказати null.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "addressAdminUnitL1",
    "titles": "Країна",
    "dc:description": "Назва країни. У колонці має бути зазначено Україна.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressAdminUnitL2",
    "titles": "Регіон",
    "dc:description": "Назва області або Автономна Республіка Крим. Наприклад: Полтавська область.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressAdminUnitL3",
    "titles": "Район",
    "dc:description": "Назва адміністративного району. Наприклад: Бориспільський район. Якщо районний поділ відсутній, вказати null.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "addressPostName",
    "titles": "Населений пункт",
    "dc:description": "Назва населеного пункту без слів “місто”, “село” та їх скорочень — “м.”, “с.”. Наприклад: Дрогобич.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressThoroughfare",
    "titles": "Вулиця",
    "dc:description": "Тип та назва вулиці або іншого топоніму, на якому знаходиться адреса: проспект, бульвар, набережна, майдан. Наприклад, вул. Харківська.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressLocatorDesignator",
    "titles": "Номер будівлі",
    "dc:description": "Номер будівлі. Номер може включати числа та букви. Наприклад, 15-А.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressLocatorName",
    "titles": "Назва будівлі або її частини",
    "dc:description": "Назва або опис, що дозволяє чіткіше визначити розміщення. Зокрема, назва житлового комплексу, школи, лікарні, офісного або торгового центру; частина будівлі, наприклад, корпус, крило; приміщення в будівлі, наприклад, квартира, кабінет, офіс, зала; інший варіант написання номера адреси; довільний текстовий опис, що дозволяє визначити розміщення; інший ідентифікатор. Якщо назва будівлі або її частини відсутня, вказати null.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "addressPostCode",
    "titles": "Поштовий індекс",
    "dc:description": "П’ятизначний поштовий індекс адреси. Наприклад, 71890.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "addressPoBox",
    "titles": "Абонентська поштова скринька",
    "dc:description": "Номер абонентської поштової скриньки. Зазначається без знаку “№”. Наприклад, 312. Якщо абонентська поштова скринька відсутня, вказати null.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "contactPointName",
    "titles": "Контактна особа/підрозділ",
    "dc:description": "Прізвище, ім’я, по батькові посадової особи або назва підрозділу, чиї контактні дані вказуються. Наприклад: Кравченко Олена Іванівна.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "contactPointHasEmail",
    "titles": "Адреса електронної пошти",
    "dc:description": "Адреса електронної пошти контактної особи, підрозділу або приймальні. Наприклад, contact@example.gov.ua. У випадку кількох адрес, значення розділити комою.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "contactPointHasTelephone",
    "titles": "Номер телефону",
    "dc:description": "Номер телефону контактної особи, підрозділу або приймальні, включаючи код країни та міста. Номер має починатися з +380, включати код населеного пункту або оператора та телефонний номер (12 цифр, без пробілів і дужок). Наприклад, +380123456789. У електронних таблицях допускається написання коду країни 380 або використання комбінації ‘+ (апостроф та плюс). У випадку кількох номерів телефону значення розділити комою.",
    "datatype": "string",
    "required": true
  },
  {
    "name": "contactPointOpeningHours",
    "titles": "Дні та години прийому",
    "dc:description": "Дні та години прийому контактної особи, підрозділу або приймальні. Дні тижня позначаються комбінаціями літер (Пн, Вт, Ср, Чт, Пт, Сб, Нд), години — цифрами у 24-годинному форматі (ГГ:ХХ). Для графіка з понеділка до п’ятниці, з 9:00 до 17:00 запис у таблиці матиме вигляд — Пн-Пт 09:00-17:00. Коли потрібно позначити інтервал днів (з понеділка по п’ятницю) використовується дефіс, коли окремі дні (понеділок та п’ятниця) — кома. Наприклад, графік прийому в понеділок і п’ятницю з 09:00-17:00 матиме такий вигляд: Пн,Пт 09:00-17:00. Якщо графік змінюється протягом тижня, різні режими прийому необхідно записати через кому. Наприклад: Пн-Чт 08:00-17:20, Пт 08:00-16:00.",
    "datatype": "string",
    "required": false
  },
  {
    "name": "contactPointAvailabRestriction",
    "titles": "Обмеження роботи",
    "dc:description": "Уточнення в довільній формі щодо обідньої перерви, днів, коли графік діє та ін. Наприклад: Перерва на обід: 12:00-13:00, Прийом відбувається лише кожного першого понеділка місяця.",
    "datatype": "string",
    "required": false
  }
]
const info = {
  id: 'organizationalUnits',
  parent: 'reference-book',
  description: 'Довідник структурних підрозділів юридичної особи розпорядника',
  legislation: '<a href="https://zakon.rada.gov.ua/laws/show/755-15">Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань”</a>, <a href="https://zakon.rada.gov.ua/laws/show/2939-17">Закон України “Про доступ до публічної інформації”</a>, нормативно-правові акти, що визначають повноваження розпорядників, наприклад, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про центральні органи виконавчої влади”</a>, <a href="https://zakon.rada.gov.ua/laws/show/3166-17">Закон України “Про місцеве самоврядування в Україні”</a>, установчі документи та інше',
  dataManagers: 'Всі розпорядники публічної інформації відповідно до частини 1 статті 13 Закону України “Про доступ до публічної інформації”',
  content: 'Ідентифікаційні та контактні дані юридичних осіб фіксуються під час затвердження установчих документів і державної реєстрації. Закон України “Про державну реєстрацію юридичних осіб, фізичних осіб-підприємців та громадських формувань” визначає перелік відомостей, які зберігаються у ЄДР (стаття 9).',
  updatedOn: 'Створення нових підприємств, установ (закладів) та організацій. Зміна їх контактних або реєстраційних даних. Зміни внутрішньоорганізаційної структури, кадрові зміни.',
  frequency: 'Позапланово (протягом трьох робочих днів з моменту внесення змін)',
  type: 'Структуровані дані',
  formats: ['XLSX', 'ODS', 'CSV', 'Other structured'],
  legalPosition,
  structure
}